summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P14_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B400u)

/** \\brief  64, Port Pin Controller Select Register */
#define P14_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B464u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P14_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003B460u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P14_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B440u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P14_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P15
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P15_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B5FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P15_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B5F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P15_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B550u)

/** \\brief  8, Identification Register */
#define P15_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B508u)

/** \\brief  24, Port Input Register */
#define P15_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B524u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P15_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B510u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P15_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B51Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P15_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B514u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P15_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B518u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P15_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B5A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P15_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003B5A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P15_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003B5A8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P15_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B594u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P15_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B580u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P15_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B58Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P15_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B584u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P15_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B588u)

/** \\brief  4, Port Output Modification Register */
#define P15_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B504u)

/** \\brief  90, Port Output Modification Set Register */
#define P15_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B590u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P15_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B570u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P15_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B57Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P15_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B574u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P15_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B578u)

/** \\brief  0, Port Output Register */
#define P15_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B500u)

/** \\brief  64, Port Pin Controller Select Register */
#define P15_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B564u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P15_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003B560u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P15_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B540u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P15_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B544u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P20
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P20_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P20_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P20_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C050u)

/** \\brief  8, Identification Register */
#define P20_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C008u)

/** \\brief  24, Port Input Register */
#define P20_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P20_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P20_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P20_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P20_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P20_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C0A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P20_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C0A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P20_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C0A8u)

