summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P23_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C300u)

/** \\brief  64, Port Pin Controller Select Register */
#define P23_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C364u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P23_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C360u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P23_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P23_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P32
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P32_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P32_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P32_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D250u)

/** \\brief  8, Identification Register */
#define P32_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D208u)

/** \\brief  24, Port Input Register */
#define P32_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P32_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P32_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P32_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P32_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D218u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P32_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D2A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P32_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003D2A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P32_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003D2A8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P32_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P32_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D280u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P32_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D28Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P32_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D284u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P32_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D288u)

/** \\brief  4, Port Output Modification Register */
#define P32_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D204u)

/** \\brief  90, Port Output Modification Set Register */
#define P32_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P32_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D270u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P32_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D27Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P32_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D274u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P32_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D278u)

/** \\brief  0, Port Output Register */
#define P32_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P32_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P32_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D260u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P32_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D240u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P32_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D244u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P33
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P33_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P33_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P33_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D350u)

/** \\brief  8, Identification Register */
#define P33_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D308u)

/** \\brief  24, Port Input Register */
#define P33_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P33_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D310u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P33_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D31Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P33_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D314u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P33_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D318u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P33_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D3A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P33_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003D3A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P33_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003D3A8u)

