summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P33_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D394u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P33_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D380u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P33_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D38Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P33_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D384u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P33_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D388u)

/** \\brief  4, Port Output Modification Register */
#define P33_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D304u)

/** \\brief  90, Port Output Modification Set Register */
#define P33_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D390u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P33_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D370u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P33_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D37Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P33_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D374u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P33_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D378u)

/** \\brief  0, Port Output Register */
#define P33_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D300u)

/** \\brief  64, Port Pin Controller Select Register */
#define P33_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D364u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P33_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D360u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P33_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P33_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P40
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003E0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003E0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P40_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003E050u)

/** \\brief  8, Identification Register */
#define P40_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003E008u)

/** \\brief  24, Port Input Register */
#define P40_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003E024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P40_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003E010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P40_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003E01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P40_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003E014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P40_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003E018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P40_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003E0A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P40_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003E0A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P40_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003E0A8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P40_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003E094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P40_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003E080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P40_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003E08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P40_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003E084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P40_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003E088u)

/** \\brief  4, Port Output Modification Register */
#define P40_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003E004u)

/** \\brief  90, Port Output Modification Set Register */
#define P40_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003E090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P40_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003E070u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P40_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003E07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P40_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003E074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P40_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003E078u)

/** \\brief  0, Port Output Register */
#define P40_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003E000u)

/** \\brief  64, Port Pin Controller Select Register */
#define P40_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003E064u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P40_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003E060u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P40_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003E040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P40_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003E044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REG_H */
